// 6. Напиши програм кој внесува петцифрен број, ги распределува сите
//цифри на бројот во посебни променливи и ги печати секоја од цифрите 
//со растојание една од дуга од три празни места. 
// Прмер. Нека корисникот внел 42139. Програмот треба да испечати:
// 4   2   1   3   9

#include <stdio.h>

int main() {
    int broj;
    scanf("%d",&broj);
    int a,b,c,d,i;
    i=broj%10;
    d=(broj/10)%10;
    c=(broj/100)%10;
    b=(broj/1000)%10;
    a=broj/10000;
    printf("%d   %d   %d   %d   %d",a,b,c,d,i);
}