// 2.Прости броеви се броеви кои се деливи само со себе си и со 
// бројот 1. Напиши програм кој внесува n елементи во низа. 
// Да се овозможи функционалност да имаме променлив број на елементи во низата.
//  Во почетокот сите елементи да се иницијализираат на 1. Потоа да се напише 
//  функција prosti која секој елемент од низата чиј индекс е прост број, 
//  го поставува на 0. На крај од така добиената низа да се најде начин да 
//  се испечатат простите броеви до n.

#include <stdio.h>

int main() {
    int n;
    printf("Vnesi broj na elementi n: ");
    scanf("%d", &n);
    int niz[n];
    for (int i = 0; i < n; i++) {
        niz[i] = 1; 
    }
    for (int i = 2; i < n; i++) { 
        int is_prime = 1;
        for (int j = 2; j * j <= i; j++) {
            if (i % j == 0) {
                is_prime = 0; 
                break;
            }
        }
        if (is_prime) {
            niz[i] = 0;
        }
    }

    printf("Prosti broevi do %d se: ", n);
    for (int i = 2; i < n; i++) {
        if (niz[i] == 0) {
            printf("%d ", i);
        }
    }
    printf("\n");

    return 0;
}
